Autodesk.Revit.DB.IFC.IFCFileReadOptions.XMLConfigFileName
The XML configuration file name. It is used only for reading IFC-XML format file.
Remarks:
It uses default configuration if it is not set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileReadOptions.FileName
The full file name of the IFC file to be read.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014